0.org/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    cylinder
    {
        type            fixedValue;
	value		uniform (0 0 0);
    }

    walls
    {
        type            fixedValue;
	value		uniform (0 0 0);
    }

    inlet
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }

    outlet
    {
        type            zeroGradient;
    }

    front-n-back
    {
        type            empty;
    }
}

