constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     1.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


5
(
front-n-back
{
    type            empty;
    physicalType    patch;
    nFaces          8976;
    startFace       7052;
}

walls
{
    type            wall;
    physicalType    patch;
    nFaces          40;
    startFace       16028;
}

inlet
{
    type            patch;
    physicalType    patch;
    nFaces          20;
    startFace       16068;
}

outlet
{
    type            patch;
    physicalType    patch;
    nFaces          20;
    startFace       16088;
}

cylinder
{
    type            wall;
    physicalType    patch;
    nFaces          80;
    startFace       16108;
}

)


// ************************************************************************* //
