system/sampleDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sampleDict;
}

setFormat raw;
surfaceFormat vtk;
interpolationScheme cellPointFace;

fields
(
    U
    p
);

sets
(
);

surfaces
(
    center-plane
    {
        type            plane;
        basePoint       (0 0 0.5);
        normalVector    (0 0 1);
        interpolate     true;
    }
);

